Autodesk.Revit.DB.Infrastructure.IAlignmentServerProxy.GetOrCreateDefaultLabelSetType(Autodesk.Revit.DB.Infrastructure.AlignmentServiceData)
Get the type with default settings for creating a label set.
If one does not exist, create it.
Since:
2021

Autodesk.Revit.DB.Infrastructure.IAlignmentServerProxy.SetInSessionDefaultLabelSetTypeId(Autodesk.Revit.DB.Infrastructure.AlignmentServiceData)
Set in-session default type for label set creation
Since:
2021

Autodesk.Revit.DB.Infrastructure.IAlignmentServerProxy.GetInSessionDefaultLabelSetTypeId(Autodesk.Revit.DB.Infrastructure.AlignmentServiceData)
Get in-session default type for label set creation
Since:
2021

Autodesk.Revit.DB.Infrastructure.IAlignmentServerProxy.GetValuesByStation(Autodesk.Revit.DB.Infrastructure.AlignmentServiceData)
Get distance and point on geometry by station
Since:
2021

Autodesk.Revit.DB.Infrastructure.IAlignmentServerProxy.GetValuesByPoint(Autodesk.Revit.DB.Infrastructure.AlignmentServiceData)
Get distance, station value and point on geometry by point
Since:
2021

Autodesk.Revit.DB.Infrastructure.IAlignmentServerProxy.GetValuesByDistance(Autodesk.Revit.DB.Infrastructure.AlignmentServiceData)
Get station value and point on geometry by alignment distance
Since:
2021